{"config": [{"config": {"input_dtype": "float32", "output_shape": null, "arguments": {}, "function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00eb\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"nb_col": 5, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "subsample": [2, 2], "nb_row": 5, "W_constraint": null, "b_constraint": null, "nb_filter": 24, "b_regularizer": null, "name": "convolution2d_1", "bias": true, "init": "he_normal", "activation": "linear", "border_mode": "same", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"nb_col": 5, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "subsample": [2, 2], "nb_row": 5, "W_constraint": null, "b_constraint": null, "nb_filter": 36, "b_regularizer": null, "name": "convolution2d_2", "bias": true, "init": "he_normal", "activation": "linear", "border_mode": "same", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"nb_col": 5, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "subsample": [2, 2], "nb_row": 5, "W_constraint": null, "b_constraint": null, "nb_filter": 48, "b_regularizer": null, "name": "convolution2d_3", "bias": true, "init": "he_normal", "activation": "linear", "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "nb_row": 3, "W_constraint": null, "b_constraint": null, "nb_filter": 64, "b_regularizer": null, "name": "convolution2d_4", "bias": true, "init": "he_normal", "activation": "linear", "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "nb_row": 3, "W_constraint": null, "b_constraint": null, "nb_filter": 64, "b_regularizer": null, "name": "convolution2d_5", "bias": true, "init": "he_normal", "activation": "linear", "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "name": "dense_1", "W_constraint": null, "batch_input_shape": [null, 3648], "b_constraint": null, "output_dim": 100, "b_regularizer": null, "input_dtype": "float32", "bias": true, "init": "he_normal", "activation": "linear", "trainable": true, "input_dim": 3648}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "name": "dense_2", "W_constraint": null, "batch_input_shape": [null, 100], "b_constraint": null, "output_dim": 50, "b_regularizer": null, "input_dtype": "float32", "bias": true, "init": "he_normal", "activation": "linear", "trainable": true, "input_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "name": "dense_3", "W_constraint": null, "batch_input_shape": [null, 50], "b_constraint": null, "output_dim": 10, "b_regularizer": null, "input_dtype": "float32", "bias": true, "init": "he_normal", "activation": "linear", "trainable": true, "input_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "name": "dense_4", "W_constraint": null, "batch_input_shape": [null, 10], "b_constraint": null, "output_dim": 1, "b_regularizer": null, "input_dtype": "float32", "bias": true, "init": "he_normal", "activation": "linear", "trainable": true, "input_dim": 10}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}